RoboEvangelist/TivaWare_C_Series-2.1.0.12573/examples/boards/ek-tm4c1294xl-boost-cc3000/cc3000_basic_wifi_application/cc3000_basic_wifi_application.c
						// if not autonomous mode, keep loop alive
						if(!autonomousMode)
						{
							if(bRunOnce)
							{
                UARTprintf("    Received %d bytes of data: \n    '",
                            i32ReturnValue);
							}
						}
						else   // autonomous mode on
						{
							ADC0_InSeq3();     // update sensor readings
							if (ui32SensorsDiff > 0)       // if right sensor > left sensor
 							{
								UARTprintf("\n\n Object too close to robot. Sensor Value: %d cm\n    ", ui32LeftSensor);
/*
								if (!obstacleInFront)
								{
									STOP();
									ROM_SysCtlDelay(100000);
								}
*/
								if (!boolTurningRight)     // if previous state was not right turn
								{
//									obstacleInFront = true;
									boolTurningRight = true;
									ROM_SysCtlDelay(10000000);
									//ROM_SysCtlDelay(20000000*0.2);
								}
								RForward1();
								
								UARTprintf(" Turning right at speed 1\n\n");
 							}
							if (ui32SensorsDiff < 0)       // if right sensor < left sensor
 							{
								UARTprintf("\n\n Object too close to robot. Sensor Value: %d cm\n    ", ui32RightSensor);
/*								if (!obstacleInFront)
								{
									STOP();
									ROM_SysCtlDelay(100000);
								} 
*/
								if (!boolTurningLeft)    // if previous turn was left turn
								{
//									obstacleInFront = true;
									boolTurningLeft = true;
									ROM_SysCtlDelay(10000000);
									//ROM_SysCtlDelay(20000000*0.2);
								}	
								LForward1();
								UARTprintf(" Turning left at speed 1\n\n");
								//obstacleInFront = true;
 							}
							else    // if difference is ~0 cm
							{
//								if (obstacleInFront)
								if (boolTurningLeft || boolTurningRight)
								{
									//ROM_SysCtlDelay(20000000*0.2);
									STOP();
									obstacleInFront = false;
								}
								
								// if already moving forward, don't send command again
								if (!boolMovingForward)
								{
									boolMovingForward = true;
									//ROM_SysCtlDelay(20000000*0.2);
								}
								Forward1();
								
							}
							// append/convert sensor int data to char
							snprintf(send_data, sizeof(send_data), "senddata 192.168.1.134 5005 %d", ui32LeftSensor);
							CmdLineProcess(send_data);
							UARTprintf("\n\nLeft Sensor Value: %d cm\n", ui32LeftSensor);
							UARTprintf("\nRight Sensor Value: %d cm\n\n", ui32RightSensor);
							UARTprintf("\n\nSensor Difference: %d cm\n", ui32SensorsDiff);
						}
						i32ReturnValue = CC3000_APP_BUFFER_SIZE;
						
        } while(i32ReturnValue == CC3000_APP_BUFFER_SIZE);
    }

    UARTprintf("'\n\n");

    return(0);
}

//*****************************************************************************
//
// Bind the open socket to a selected port.
// Arguments:
// [1] Port to Bind to
//
// Requires Socket Open before running.
//
//*****************************************************************************

int CMD_bind(int argc, char **argv)
{
    uint32_t ui32Port = 5005;     // lets hard code the port number
    int8_t i8Check = 0;
    
    //
    // Validate input.
    //
    //
    // Family is Always AF_INET on CC3000
    //
    g_tSocketAddr.sa_family = AF_INET;

    //
    // Set the port to bind the socket to.
    //
//    ui32Port = ustrtoul(port_number,0,10);      //convert port string to int
    g_tSocketAddr.sa_data[0] = (ui32Port & 0xFF00) >> 8;
    g_tSocketAddr.sa_data[1] = (ui32Port & 0x00FF) >> 0;

    //
    // Set IP to 0.0.0.0
    //
    memset (&g_tSocketAddr.sa_data[2], 0, 4);
		UARTprintf("    Address port %d\n", g_tSocketAddr.sa_data[2]);

    //
    // Low Level API call
    //
    i8Check = bind(g_ui32Socket, &g_tSocketAddr, sizeof(sockaddr));
		//listen(g_ui32Socket, 100);

    if(i8Check == 0)
    {
        UARTprintf("    Bind Successful to port %d, 0x%x\n",
                   (g_tSocketAddr.sa_data[0] << 8) + g_tSocketAddr.sa_data[1],
                   (g_tSocketAddr.sa_data[0] << 8) + g_tSocketAddr.sa_data[1]);

        //
        // Set global flag variable to indicate the socket has been bound.
        //
        g_ui32BindFlag = 0;
    }
    else
    {
        UARTprintf("    Bind Failed. bind() returned code '%d'\n",i8Check);

        //
        // set global flag variable to indicate the socket is not bound.
        //
        g_ui32BindFlag = SENTINEL_EMPTY;
    }
		
    return(0);
}

//*****************************************************************************
//
// This command configures the IP address for the CC3000.
// This configuration can also be accomplished by running smartconfig.
// For DHCP give no arguments or specify 0 for all arguments.
// For a static IP specify the arguments
// Arguments:
// [1]  IPaddress in dot-decimal format xxx.XXX.yyy.YYY
// [2]  Default Gateway in dot-decimal format xxx.XXX.yyy.YYY
// [3]  Network Mask (optional, if not given assumed to be 255.255.255.0)
//
// To test connectivity ping the address from a computer.
//
//*****************************************************************************
int
CMD_ipConfig(int argc, char **argv)
{
    int32_t i32Check;
    uint8_t ui8IP[4], ui8Gateway[4], ui8NetMask[4];
    uint32_t ui32IP = 0, ui32Gateway = 0, ui32NetMask = 0, ui32DNS = 0;

    //
    // Validate input.
    //
    if(1 == argc)
    {
        //
        // If using DHCP, set all variables to 0.
        //
        ui8NetMask[0] = 0;
        ui8NetMask[1] = 0;
        ui8NetMask[2] = 0;
        ui8NetMask[3] = 0;

        ui8Gateway[0] = 0;
        ui8Gateway[1] = 0;
        ui8Gateway[2] = 0;
        ui8Gateway[3] = 0;

        ui8IP[0] = 0;
        ui8IP[1] = 0;
        ui8IP[2] = 0;
        ui8IP[3] = 0;

    }
    else if(argc < 3)
    {
        return(CMDLINE_TOO_FEW_ARGS);
    }
    else if(argc > 4)
    {
        return(CMDLINE_TOO_MANY_ARGS);
    }
    else
    {
        //
        // Handle IP Address
        //
        i32Check = DotDecimalDecoder(argv[1], &ui8IP[0], &ui8IP[1], &ui8IP[2],
                                     &ui8IP[3]);
        if(i32Check == COMMAND_FAIL)
        {
            UARTprintf("    Invalid IP Address\n");
            return(CMDLINE_INVALID_ARG);
        }

        //
        // Handle Default Gateway
        //
        i32Check = DotDecimalDecoder(argv[2], &ui8Gateway[0], &ui8Gateway[1],
                                     &ui8Gateway[2], &ui8Gateway[3]);
        if(i32Check == COMMAND_FAIL)
        {
            UARTprintf("    Invalid Gateway Address\n");
            return(CMDLINE_INVALID_ARG);
        }

        //
        // Handle Network Mask
        //
        if(argc == 4)
        {
            //
            // If provided, fill out Network Mask
            //
            i32Check = DotDecimalDecoder(argv[3], &ui8NetMask[0],
                                         &ui8NetMask[1], &ui8NetMask[2],
                                         &ui8NetMask[3]);

            if(i32Check == COMMAND_FAIL)
            {
                UARTprintf("    Invalid Network Mask\n");
                return(CMDLINE_INVALID_ARG);
            }
        }
        else
        {
            //
            // No Network Mask given, default to 255.255.255.0
            //
            ui8NetMask[0] = 255;
            ui8NetMask[1] = 255;
            ui8NetMask[2] = 255;
            ui8NetMask[3] = 0;
        }
    }

    //
    // Fill the variables
    //
    ui32IP = ((ui8IP[3] << 24) + (ui8IP[2] << 16) +
              (ui8IP[1] << 8 ) + (ui8IP[0] << 0 ));

    ui32Gateway = ((ui8Gateway[3] << 24) + (ui8Gateway[2] << 16) +
                   (ui8Gateway[1] <<  8) + (ui8Gateway[0] <<  0));

    ui32NetMask = ((ui8NetMask[3] << 24) + (ui8NetMask[2] << 16) +
                   (ui8NetMask[1] <<  8) + (ui8NetMask[0] <<  0));

    //
    // API Call
    //
    i32Check = netapp_dhcp( (unsigned long *)&ui32IP,
                            (unsigned long *)&ui32NetMask,
                            (unsigned long *)&ui32Gateway,
                            (unsigned long *)&ui32DNS);

    //
    // Validate return for success / failure.
    //
    if(i32Check == COMMAND_SUCCESS)
    {
        UARTprintf("    IPConfig completed Successfully.\n");
    }
    else
    {
        UARTprintf("    IPConfig Failed. netapp_dhcp() returned code '%d'\n",
                    i32Check);
    }

    return(0);
}

//*****************************************************************************
//
// Disconnect from Access Point.
// Arguments: None
//
//*****************************************************************************
int
CMD_disconnect(int argc, char **argv)
{
    int32_t i32Check;

    //
    // Call API to disconnect
    //
    i32Check = wlan_disconnect();

    //
    // Check disconnection
    //
    if(i32Check == COMMAND_SUCCESS)
    {
        UARTprintf("    CC3000 Disconnected Successfully.\n");
    }
    else
    {
        UARTprintf("    CC3000 already disconnected.\n");
    }

    //
    // Turn on LED1.
    //
    turnLedOn(LED1);

    return(0);
}

//*****************************************************************************
//
// Remove the automatic connection policy from the CC3000. On reset it will no
// longer attempt to automatically connect to the Access Point.
// Arguments: None
//
//*****************************************************************************
int
CMD_deletePolicy(int argc, char **argv)
{
    int32_t i32Check;

    //
    // API Call to Disconnect
    //
    i32Check = wlan_ioctl_set_connection_policy(DISABLE, DISABLE, DISABLE);

    if(i32Check == COMMAND_SUCCESS)
    {
        UARTprintf("    Policy Deleted Successfully.\n");
    }
    else
    {
        UARTprintf("    Delete Policy failed with error code '%d'\n",i32Check);
    }

    return(0);
}

//*****************************************************************************
//
// Send an mDNS query packet.
// Arguments:
// [1] (Optional) specify the name to advertise with.
//
//*****************************************************************************
int
CMD_mdnsadvertise(int argc, char **argv)
{
    uint32_t ui32x = 0;
    int32_t i32Check = 0;

    //
    // Validate input.
    //
    if(argc < 1)
    {
        return(CMDLINE_TOO_FEW_ARGS);
    }
    else if(argc > 2)
    {
        return(CMDLINE_TOO_MANY_ARGS);
    }

    //
    // Choose mDNS Name.
    //
    if(1 == argc)
    {
        //
        // Use hard coded name.
        //
        //
        UARTprintf("    mdns advertising as: '%s'...\n",g_pcdevice_name);
        for(ui32x = 0; ((ui32x < 100) && (i32Check != 0)); ui32x++)
        {
            i32Check = mdnsAdvertiser(1, g_pcdevice_name,
                                      sizeof(g_pcdevice_name));
        }

